notebook/blog-2008-01-28-1427.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Eon mini-beta release</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:52 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="Eon mini-beta release"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Eon mini-beta release</h1>

<p>I would like to put two small files out for your review. This is a
beta of Eon with some example code. Questions and comments on the
design and implementation are welcome.
</p>
<p>
I feel good enough about the state of Eon to start really building
some applications, but I wanted to throw Eon out there for some peer
review before I get going. It's been tremendously helpful in the past,
so keep those comments coming!
</p>
<p>
Downloads:
</p>
<ul>
<li><a href="../eon/eon.el">eon.el</a> &mdash; the eon object system
</li>
<li><a href="../eon/eon-guide.el">eon-guide.el</a> &mdash; some working code examples to try
</li>
</ul>


<p>
Requirements:
</p>
<ul>
<li><a href="http://www.gnu.org/software/emacs/">GNU Emacs 22</a> or later
</li>
<li>A method of generating UUIDs (Universally Unique Identifiers). By
   default, the external program "uuidgen" is used; this comes with
   the e2fsprogs package.
</li>
</ul>


</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:52 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
